; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob45) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 depot1)
	(clear crate9)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate3)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear crate5)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear crate6)
	(at pallet9 depot2)
	(clear crate2)
	(at pallet10 depot0)
	(clear crate7)
	(at pallet11 distributor1)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear pallet12)
	(at pallet13 depot0)
	(clear crate8)
	(at pallet14 distributor2)
	(clear pallet14)
	(at truck0 depot0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at crate0 depot0)
	(on crate0 pallet10)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot2)
	(on crate2 pallet9)
	(at crate3 distributor1)
	(on crate3 pallet4)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(at crate5 depot1)
	(on crate5 pallet6)
	(at crate6 distributor2)
	(on crate6 pallet8)
	(at crate7 depot0)
	(on crate7 crate0)
	(at crate8 depot0)
	(on crate8 pallet13)
	(at crate9 depot1)
	(on crate9 pallet1)
)

(:goal (and
		(on crate0 pallet12)
		(on crate1 pallet2)
		(on crate2 pallet11)
		(on crate3 crate5)
		(on crate4 pallet5)
		(on crate5 pallet10)
		(on crate6 crate8)
		(on crate7 pallet9)
		(on crate8 pallet7)
		(on crate9 pallet3)
	)
))

; plan
1. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 0 of 10
2. (lift hoist7 crate2 pallet9 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist7) (on crate2 pallet9)
   added: (lifting hoist7 crate2) (clear pallet9)
   goals met: 0 of 10
3. (lift hoist6 crate3 pallet4 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist6) (on crate3 pallet4)
   added: (lifting hoist6 crate3) (clear pallet4)
   goals met: 0 of 10
4. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet3)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 0 of 10
5. (lift hoist1 crate5 pallet6 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet6)
   added: (lifting hoist1 crate5) (clear pallet6)
   goals met: 0 of 10
6. (load hoist1 crate5 truck1 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 0 of 10
7. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 10
8. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 0 of 10
9. (load hoist7 crate2 truck0 depot2)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck0) (available hoist7)
   goals met: 0 of 10
10. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 0 of 10
11. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 10
12. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 0 of 10
13. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 10
14. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 0 of 10
15. (unload hoist5 crate4 truck0 distributor2)
   deleted: (in crate4 truck0) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 0 of 10
16. (drop hoist5 crate4 pallet5 distributor2)
   deleted: (lifting hoist5 crate4) (clear pallet5)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 pallet5)
   goals met: 1 of 10
17. (lift hoist5 crate6 pallet8 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 pallet8)
   added: (lifting hoist5 crate6) (clear pallet8)
   goals met: 1 of 10
18. (load hoist5 crate6 truck0 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck0) (available hoist5)
   goals met: 1 of 10
19. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 1 of 10
20. (lift hoist1 crate9 pallet1 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 pallet1)
   added: (lifting hoist1 crate9) (clear pallet1)
   goals met: 1 of 10
21. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 1 of 10
22. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 1 of 10
23. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 1 of 10
24. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 10
25. (unload hoist3 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist3)
   added: (lifting hoist3 crate9)
   goals met: 1 of 10
26. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 10
27. (drop hoist3 crate9 pallet3 distributor0)
   deleted: (lifting hoist3 crate9) (clear pallet3)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 pallet3)
   goals met: 2 of 10
28. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 10
29. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 2 of 10
30. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 2 of 10
31. (drop hoist4 crate2 pallet11 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet11)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet11)
   goals met: 3 of 10
32. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 3 of 10
33. (unload hoist4 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist4)
   added: (lifting hoist4 crate5)
   goals met: 3 of 10
34. (drop hoist4 crate5 pallet4 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet4)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet4)
   goals met: 3 of 10
35. (lift hoist0 crate7 crate0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate0)
   added: (lifting hoist0 crate7) (clear crate0)
   goals met: 3 of 10
36. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 3 of 10
37. (lift hoist0 crate0 pallet10 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet10)
   added: (lifting hoist0 crate0) (clear pallet10)
   goals met: 3 of 10
38. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   goals met: 3 of 10
39. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 3 of 10
40. (unload hoist7 crate7 truck0 depot2)
   deleted: (in crate7 truck0) (available hoist7)
   added: (lifting hoist7 crate7)
   goals met: 3 of 10
41. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 3 of 10
42. (drop hoist7 crate7 pallet9 depot2)
   deleted: (lifting hoist7 crate7) (clear pallet9)
   added: (available hoist7) (at crate7 depot2) (clear crate7) (on crate7 pallet9)
   goals met: 4 of 10
43. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 4 of 10
44. (drop hoist0 crate6 crate8 depot0)
   deleted: (lifting hoist0 crate6) (clear crate8)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate8)
   goals met: 5 of 10
45. (drop hoist6 crate3 crate5 distributor1)
   deleted: (lifting hoist6 crate3) (clear crate5)
   added: (available hoist6) (at crate3 distributor1) (clear crate3) (on crate3 crate5)
   goals met: 6 of 10
46. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 6 of 10
47. (unload hoist6 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 6 of 10
48. (drop hoist6 crate0 pallet12 distributor1)
   deleted: (lifting hoist6 crate0) (clear pallet12)
   added: (available hoist6) (at crate0 distributor1) (clear crate0) (on crate0 pallet12)
   goals met: 7 of 10
49. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 7 of 10
50. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 7 of 10
51. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 7 of 10
52. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 7 of 10
53. (unload hoist7 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 7 of 10
54. (drop hoist7 crate1 pallet2 depot2)
   deleted: (lifting hoist7 crate1) (clear pallet2)
   added: (available hoist7) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 8 of 10
55. (lift hoist6 crate3 crate5 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist6) (on crate3 crate5)
   added: (lifting hoist6 crate3) (clear crate5)
   goals met: 7 of 10
56. (lift hoist4 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet4)
   added: (lifting hoist4 crate5) (clear pallet4)
   goals met: 7 of 10
57. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   goals met: 7 of 10
58. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 7 of 10
59. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 7 of 10
60. (drop hoist0 crate5 pallet10 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet10)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet10)
   goals met: 8 of 10
61. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 8 of 10
62. (load hoist6 crate3 truck1 distributor1)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck1) (available hoist6)
   goals met: 8 of 10
63. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 8 of 10
64. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 8 of 10
65. (drop hoist0 crate3 crate5 depot0)
   deleted: (lifting hoist0 crate3) (clear crate5)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate5)
   goals met: 9 of 10
66. (lift hoist0 crate6 crate8 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate8)
   added: (lifting hoist0 crate6) (clear crate8)
   goals met: 8 of 10
67. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 8 of 10
68. (lift hoist0 crate8 pallet13 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet13)
   added: (lifting hoist0 crate8) (clear pallet13)
   goals met: 8 of 10
69. (load hoist0 crate8 truck1 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck1) (available hoist0)
   goals met: 8 of 10
70. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 8 of 10
71. (unload hoist1 crate8 truck1 depot1)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 8 of 10
72. (drop hoist1 crate8 pallet7 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet7)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet7)
   goals met: 9 of 10
73. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 9 of 10
74. (drop hoist1 crate6 crate8 depot1)
   deleted: (lifting hoist1 crate6) (clear crate8)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 crate8)
   goals met: 10 of 10
